IDEA Open Model
TimePoint Properties
The TimePoint type exposes the following members.
Properties
Name | Description
Age
 Age
AllowCheckInAgeLess3Days
 true to allow chec in age less 3 days
Description
 Description
Fix2DRotation
 true to fix around Y axis ( Mz is not taken into account )
LastConstructionStage
 Last construction stage - Time of the start of cyclic loading for fatigue check
Name
 Name of time point
Prestressing
 Prestressing
Stage
 Stage
Time
 Time
Top
See Also
Reference
TimePoint Class
IdeaRS.OpenModel.Concrete Namespace